{
  "id": "miniglue",
  "name": "miniGLUE",
  "description":"miniGLUE",
  "logo":"https://explainaboard.s3.amazonaws.com/benchmarks/figures/gaokao.jpg",
  "datasets": [
    {"dataset_name": "sst2", "task": "text-classification", "metrics": [{"name": "F1", "weight": 0.2, "default": 0.0},
                                                                        {"name": "Accuracy", "weight": 0.8, "default":  0.0}]},
    {"dataset_name": "snli", "task": "natural-language-inference", "metrics": [{"name": "Accuracy"}]}
  ],
  "views": [
    {
      "name": "Overall",
      "operations": [
        {"op": "weighted_sum", "group_by": "dataset_name", "weight": "metric_weight"},
        {"op": "mean"}
      ]
    },
    {
      "name": "Task-weighted Overall",
      "operations": [
        {"op": "weighted_sum", "group_by": ["dataset_name", "task"], "weight": "metric_weight"},
        {"op": "weighted_sum", "weight": "task", "weight_map": {"text-classification":  0.7, "natural-language-inference": 0.3}}
      ]
    },
    {
      "name": "Task-wise Average",
      "operations": [
        {"op": "weighted_sum", "group_by": ["dataset_name", "task"], "weight": "metric_weight"},
        {"op": "mean", "group_by": "task"}
      ]
    }
  ],
  "default_views": ["Overall"]
}